[
  {
    "name": "Bench Press",
    "primary_muscles": ["Chest", "Triceps"],
    "secondary_muscles": ["Abs"],
    "equipment": ["Barbell"],
    "description": "The bench press is an upper-body weight training exercise in which the trainee presses a weight upwards while lying on a weight training bench. The exercise uses the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles (Wikipedia, 2021)."
  },
  {
    "name": "Squat",
    "primary_muscles": ["Quads", "Hamstrings", "Glutes"],
    "secondary_muscles": ["Abs"],
    "equipment": ["Barbell"],
    "description": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent of a squat, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up (Wikipedia, 2021)."
  },
  {
    "name": "Military Press",
    "primary_muscles": ["Shoulders"],
    "secondary_muscles": ["Abs", "Back"],
    "equipment": ["Barbell"],
    "description": "The overhead press (abbreviated OHP), also referred to as a shoulder press, military press, or simply the press, is a weight training exercise with many variations. It is typically performed while either standing or sitting sometimes also when squatting, in which a weight is pressed straight upwards from racking position until the arms are locked out overhead, while the legs, lower back and abs maintain balance (Wikipedia)."
  },
  {
    "name": "Deadlift",
    "primary_muscles": ["Back", "Hamstrings"],
    "secondary_muscles": ["Quads", "Abs"],
    "equipment": ["Barbell"],
    "description": "The deadlift is a weight training exercise in which a loaded barbell or bar is lifted off the ground to the level of the hips, torso perpendicular to the floor, before being placed back on the ground. It is one of the three powerlifting exercises, along with the squat and bench press (Wikipedia, 2021)."
  }
]